leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/Mcu_Hw_mpc57xx.c
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 * 
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with  
 * the terms contained in the written license agreement between you and ArcCore, 
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as 
 * published by the Free Software Foundation and appearing in the file 
 * LICENSE.GPL included in the packaging of this file or here 
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

/** @reqSettings DEFAULT_SPECIFICATION_REVISION=4.1.2 */
/** @tagSettings DEFAULT_ARCHITECTURE=MPC5744P|MPC5777M|MPC5748G|MPC5747C */

/* Global requirements */
/* @req SWS_Mcu_00237 Mcu_ModeType specifies the identification mode */
/* @req SWS_Mcu_00239 Mcu_RamSectionType specifies the identification of ram section */
/* @req SWS_Mcu_00232 Mcu_ClockType defines the identification of clock type*/
/* @req SWS_Mcu_00051 Mcu_ModeType specifies the identification*/
/* @req SWS_Mcu_00152 Imported types */



#define _DEBUG_
/* ----------------------------[includes]------------------------------------*/

#include <string.h>
#include "Std_Types.h"
#include "SchM_Mcu.h"
#include "Mcu.h"
#include "Mcu_Internal.h"
#if defined(USE_DET)
#include "Det.h"
#endif
#if defined(USE_DEM)
#include "Dem.h"
#endif
#include "mpc55xx.h"
#include "Cpu.h"
#include "io.h"
#if defined(USE_KERNEL)
#include "irq.h"
#endif

#include "debug.h"

#include "Mcu_Arc.h"

/* ----------------------------[private define]------------------------------*/

#ifndef ARRAY_SIZE
#define ARRAY_SIZE(_x)  (sizeof(_x)/sizeof((_x)[0]))
#endif

#define CORE_PVR_E200Z4251N3    0x81560011UL
#define CORE_PVR_E200Z425N3     0x815F8000UL
#define CORE_PVR_E200Z720N3     0x81680000UL
#define CORE_PVR_E200Z210N3     0x81680000UL
#define CORE_PVR_E200Z4204N3    0x81530000UL

#define WDG_SOFTLOCK_WORD_1   0x0000c520uL
#define WDG_SOFTLOCK_WORD_2   0x0000d928uL



/* ----------------------------[private macro]-------------------------------*/

#if defined(CFG_MPC5744P)
#define CALC_SYSTEM_CLOCK(_extal,_emfd,_eprediv,_erfd)  \
            ( (((_extal)/(_eprediv))*(_emfd)) / ((_erfd)) )
#elif defined(CFG_MPC5777M)
// This macro is not used on this target since it is hard to define what the system clock is
#endif

/* ----------------------------[private typedef]-----------------------------*/
/* ----------------------------[private function prototypes]-----------------*/
/* ----------------------------[private variables]---------------------------*/
/*lint -esym(9003, cpu_info_list) OTHER Cannot be defined at block scope */
const cpu_info_t cpu_info_list[] = {
#if defined(CFG_MPC5744P)
    {
        .name = "MPC5744P",
        .pvr = CORE_PVR_E200Z4251N3,
        .info = "aa"
    },
#elif defined(CFG_MPC5746C)
    {
        .name = "MPC5746C",
        .pvr = CORE_PVR_E200Z4204N3,
        .info = "Core 0"
    },
    {
        .name = "MPC5746C",
        .pvr = CORE_PVR_E200Z210N3,
        .info = "Core 1"
    },
#elif defined(CFG_MPC5748G)
    {
        .name = "MPC5748G",
        .pvr = CORE_PVR_E200Z4204N3,
        .info = "Core 0"
    },
    {
        .name = "MPC5748G",
        .pvr = CORE_PVR_E200Z4204N3,
        .info = "Core 1"
    },
    {
        .name = "MPC5748G",
        .pvr = CORE_PVR_E200Z210N3,
        .info = "Core 3"
    },
#elif defined(CFG_MPC5747C)
	{
		.name = "MPC5747C",
		.pvr = CORE_PVR_E200Z4204N3,
		.info = "Core 0"
	},
	/* The Z2 is still called Core 3 on this chip,
	 * even with the Z4 only being single-core
	 */
	{
		.name = "MPC5747C",
		.pvr = CORE_PVR_E200Z210N3,
		.info = "Core 3"
	},
#elif defined(CFG_MPC5777M)
    {
        .name = "MPC5777M",
        .pvr = CORE_PVR_E200Z720N3,
        .info = ""
    },
    {
        .name = "MPC5777M",
        .pvr = CORE_PVR_E200Z720N3,
        .info = ""
    },
    {
        .name = "MPC5777M",
        .pvr = CORE_PVR_E200Z425N3,
        .info = ""
    },
#endif
};
/*lint -esym(9003, core_info_list) OTHER Cannot be defined at block scope */
const core_info_t core_info_list[] = {
#if defined(CFG_MPC5744P)
    {
        .name = "MPC5744P",
        .pvr = CORE_PVR_E200Z4251N3,
        .info = "Max Freq: 200Mhz, ICache: Yes (8KB)"
    },
#elif defined(CFG_MPC5777M)
    {
        .name = "E200Z720",
        .pvr = CORE_PVR_E200Z720N3,
        .info = ""
    },
    {
        .name = "E200Z720",
        .pvr = CORE_PVR_E200Z720N3,
        .info = ""
    },
    {
        .name = "E200Z4251N3",
        .pvr = CORE_PVR_E200Z425N3,
        .info = ""
    },
#elif defined(CFG_MPC5746C)
    {
        .name = "E200Z420",
        .pvr = CORE_PVR_E200Z4204N3,
        .info = "Main Core 0: Max freq. 160MHz, 8KB i-cache, 4KB d-cache"
    },
    {
        .name = "E200Z210",
        .pvr = CORE_PVR_E200Z210N3,
        .info = "Peripheral Core 1: Max freq. 80MHz"
    },
#elif defined(CFG_MPC5748G)
    {
        .name = "E200Z420",
        .pvr = CORE_PVR_E200Z4204N3,
        .info = "Main Core 0: Max freq. 160MHz, 8KB i-cache, 4KB d-cache"
    },
    {
        .name = "E200Z420",
        .pvr = CORE_PVR_E200Z4204N3,
        .info = "Main Core 1: Max freq. 160MHz, 8KB i-cache, 4KB d-cache"
    },
    {
        .name = "E200Z210",
        .pvr = CORE_PVR_E200Z210N3,
        .info = "Peripheral Core 2: Max freq: 80Mhz"
    },
#elif defined(CFG_MPC5747C)
    {
        .name = "E200Z420",
        .pvr = CORE_PVR_E200Z4204N3,
        .info = "Main Core 0: Max freq. 160MHz, 8KB i-cache, 4KB d-cache"
    },
    {
        .name = "E200Z210",
        .pvr = CORE_PVR_E200Z210N3,
        .info = "Peripheral Core 2: Max freq: 80Mhz"
    },
#endif
};

/* ----------------------------[private functions]---------------------------*/





static void GetAndClearResetCause(void) {
    Mcu_ResetType resetReason;
    /*lint -save -e970, -e9018, -e923 HARDWARE_ACCESS */
    typeof(MC_RGM.DES) rawValueDES;
    typeof(MC_RGM.FES) rawValueFES;

    /* DES and FES is 32 bit */
    rawValueDES.R = MC_RGM.DES.R;
    rawValueFES.R = MC_RGM.FES.R;

    MC_RGM.DES.R = rawValueDES.R;   /* Clear */
    MC_RGM.FES.R = rawValueFES.R;   /* Clear */
    /*lint -restore */

#if defined(CFG_MPC5744P) || defined(CFG_MPC5777M)
    if( rawValueDES.B.F_EDR ) {
        resetReason = MCU_POWER_ON_RESET;
    } else if( rawValueFES.B.F_SOFT_FUNC ) {
        resetReason = MCU_SW_RESET;
#else
        /*lint -e{9036} HARDWARE_ACCESS */
    if( rawValueFES.B.F_SOFT_FUNC ) {
        resetReason = MCU_SW_RESET;
#endif
#if 0
    /* IMPROVEMENT: watch dog reset cause not checked for 5744 */
    } else if( MC_RGM.FES.B.F_FCCU_HARD ) {
        if() check fccu if watchdog caused reset
        rv = MCU_WATCHDOG_RESET;
    }
#endif
    } else if( rawValueDES.B.F_POR ) {
        resetReason = MCU_POWER_ON_RESET;
    } else {
        resetReason = MCU_RESET_UNDEFINED;
    }

    /*lint -e{632, 931, 712} HARDWARE_ACCESS */
    Mcu_Global.rawResetvalue = ((((uint64)rawValueDES.R)<<32) + rawValueFES.R);

    /* @req SWS_Mcu_00005 */
    Mcu_Global.resetReason = resetReason;
}



