leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/Mcu_Hw_mpc57xx.c
const cpu_info_t * Mcu_Arc_GetCpuInfoList( uint32 *num ) {
    *num = (sizeof(cpu_info_list)/sizeof((cpu_info_list)[0u]));
    return cpu_info_list;
}

const core_info_t * Mcu_Arc_GetCoreInfoList( uint32 *num ) {
    *num = (sizeof(core_info_list)/sizeof((cpu_info_list)[0u]));
    return core_info_list;
}


/*lint -e{715} Info: Symbol 'ConfigPtr' not referenced.
 * This is OK. For other implementations than RH850F1H the variable might be used. */
void Mcu_Hw_Init( const Mcu_ConfigType *ConfigPtr ) {

    GetAndClearResetCause();

    /* Call Integration part */
    Mcu_Arc_InitPost(ConfigPtr);
}

#if ( MCU_NO_PLL == STD_OFF )

#if ( MCU_INIT_CLOCK == STD_ON )

Std_ReturnType Mcu_Hw_InitClock( const Mcu_ClockSettingConfigType *clockSettingsPtr ) {
    /* Call integration part */
    Mcu_Arc_InitClockPre(clockSettingsPtr);


   /*lint -e{920} General interface, the clockSettingsPtr may be needed for other architectures */
   (void)clockSettingsPtr;

   /* Handled individually for each mpc in post integration function */
   Mcu_Arc_InitClockPost(clockSettingsPtr);

   return E_OK;
}
#endif

#endif /*  ( MCU_NO_PLL == STD_OFF ) */


//-------------------------------------------------------------------


Mcu_PllStatusType Mcu_Hw_GetPllStatus(void)
{
    Mcu_PllStatusType rv;

#if defined(CFG_MPC5748G) || defined(CFG_MPC5747C) ||defined(CFG_MPC5746C)
    /*lint -e{923} HARDWARE_ACCESS */
    if ( 0u == PLLDIG.PLLSR.B.LOCK) {
#else
    if ( 0u == PLLDIG.PLL0SR.B.LOCK) {
#endif
        rv = MCU_PLL_UNLOCKED;
    } else {
        rv = MCU_PLL_LOCKED;
    }

    /* @req SWS_Mcu_00008, The function Mcu_GetPllStatus shall return the lock status of the PLL*/
    return rv;
}


#if ( MCU_PERFORM_RESET_API == STD_ON )
/* @req SWS_Mcu_00143 */
/* !req SWS_Mcu_00144 */
void Mcu_Hw_PerformReset(void)
{
    MC_ME.MCTL.R = 0x00005AF0;   /* Reset, 0x5AF0 is control key to enable writing to register */
    MC_ME.MCTL.R = 0x0000A50F;   /* Reset, 0xA50F is inverted control key to enable writing to register */

    while(MC_ME.GS.B.S_MTRANS != 0) {}
    while(MC_ME.GS.B.S_CURRENTMODE != 0) {}
}
#endif

//-------------------------------------------------------------------


Std_ReturnType Mcu_Hw_DistributePllClock(void)
{
    /* !req SWS_Mcu_00140  */
    /* !req SWS_Mcu_00141 */
    /* !req SWS_Mcu_00056 */

#if defined(CFG_MPC5748G) || defined(CFG_MPC5747C) ||defined(CFG_MPC5746C)
    /*lint -e{904, 923} ARGUMENT_CHECK, HARDWARE_ACCESS*/
    VALIDATE_W_RV( ( PLLDIG.PLLSR.B.LOCK == 1 ), MCU_DISTRIBUTEPLLCLOCK_SERVICE_ID, MCU_E_PLL_NOT_LOCKED, E_NOT_OK);
#else
    VALIDATE_W_RV( ( PLLDIG.PLL0SR.B.LOCK == 1 ), MCU_DISTRIBUTEPLLCLOCK_SERVICE_ID, MCU_E_PLL_NOT_LOCKED, E_NOT_OK);
#endif
    return E_OK;
}


/*lint -e{715} Info: Symbol 'mcuMode' not referenced.
 * This is OK. For other implementations than RH850F1H the variable might be used. */
void Mcu_Hw_SetMode( Mcu_ModeType mcuMode)
{

}


void Mcu_Arc_PlatformInit( void ) {
#if defined(CFG_MPC5744P)
    static const uint64 setVal = 0u;

    /* Init System SRAM, 384K  */
    memset_uint64((void *)0x40000000UL, &setVal, 0x00060000UL);

    AIPS_0.MPRA.R = 0x70777700UL;   /* Enable all */

    /* PACR */
    AIPS_0.PACR[0].R = 0UL; /* A */
    AIPS_0.PACR[1].R = 0UL; /* B */
    AIPS_0.PACR[2].R = 0UL; /* C */
    AIPS_0.PACR[3].R = 0UL; /* D */
    /* E is reserved */
    AIPS_0.PACR[5].R = 0UL; /* F */
    AIPS_0.PACR[6].R = 0UL; /* G */
    AIPS_0.PACR[7].R = 0UL; /* H */

    /* OPACR */
    for (uint32 i=0;i < 32;i++) {
        AIPS_0.OPACR[i].R = 0UL;
    }

    /* Make sure that bus aborts triggers Prefetch or Data Abort exception */
    SSCM.ERROR.B.PAE = 1u;
    SSCM.ERROR.B.RAE = 1u;

    /*
     * From MPC5744P datasheet.
     *                                RWSC  APC
     * 167 MHz < fCPU ≤ 200 MHz       5     2
     */
    const typeof(PFLASH.PFCR1.B) val = {
            .P0_M0PFE = 1,
            .APC=2,
            .RWSC=5,
            .P0_DPFEN = 0,
            .P0_IPFEN = 1,
            .P0_PFLIM = 2,
            .P0_BFEN  = 1 };

    PFLASH.PFCR1.B =  val;
#elif defined(CFG_MPC5748G) || defined(CFG_MPC5746C)
    /*lint -save -e923 HARDWARE_ACCESS */
    AIPS_0.MPRA.R = 0x70777700UL;   /* Enable all */

     /* PACR */
     AIPS_0.PACR[0].R = 0UL; /* A */
     AIPS_0.PACR[1].R = 0UL; /* B */
     AIPS_0.PACR[2].R = 0UL; /* C */
     AIPS_0.PACR[3].R = 0UL; /* D */
     /* E is reserved */
     AIPS_0.PACR[5].R = 0UL; /* F */
     AIPS_0.PACR[6].R = 0UL; /* G */
     AIPS_0.PACR[7].R = 0UL; /* H */
     /*lint -restore*/

     /* OPACR */
     for (uint32 i=0;i < 32;i++) {
         /*lint -e{923} HARDWARE_ACCESS */
         AIPS_0.OPACR[i].R = 0UL;
     }

     /*
      * From MPC5748 datasheet.
      *                                RWSC  APC
      * 133 MHz < fFlash <= 160 MHz       4    1
      * */
     /*lint -e{970} HARDWARE_ACCESS */
     const typeof(PFLASH.PFCR1.B) val = {
        .P0_M0PFE = 1,
        .APC=1,
        .RWSC=4,
        .P0_DPFEN = 0,
        .P0_IPFEN = 1,
        .P0_PFLIM = 2,
        .P0_BFEN  = 1 };
     /*lint -e{923} HARDWARE_ACCESS */
     PFLASH.PFCR1.B =  val;
#endif

}


void Mcu_Arc_WdgExtendTimeout( void ) {
#if defined(CFG_MPC5744P)
//#define SWT SWT_0
    /* Disable watchdog. Watchdog is enabled default after reset.*/
    SWT.SR.R = WDG_SOFTLOCK_WORD_1;
    SWT.SR.R = WDG_SOFTLOCK_WORD_2;
    SWT.CR.R = 0x8000010Au;         /* Disable Watchdog */

#if defined(USE_WDG)
    SWT.TO.R = (uint32)(16000000u*0.5); /* set timeout to 500ms 16MHz IRC clock */
    SWT.CR.R = 0x8000011Bu;             /* enable watchdog */
#endif
#endif

#if defined(CFG_MPC5777M)

    for(uint8 i=0; i<4; i++){
        volatile struct SWT_tag *swtPtr = (volatile struct SWT_tag *)(0xFC050000UL + i*0x4000ul);

        /* Disable watchdog. Watchdog is enabled default after reset.*/
        swtPtr->SR.R = WDG_SOFTLOCK_WORD_1;
        swtPtr->SR.R = WDG_SOFTLOCK_WORD_2;
        swtPtr->CR.R = 0xE000010AuL;         /* Disable Watchdog */
#if defined(USE_WDG)
        if(i==0){
            SWT_0.TO.R = (uint32)(16000000u*0.5); /* set timeout to 500ms 16MHz IRC clock */
            SWT_0.CR.R = 0xE000011BuL; /* Access for all cores */
        }
#endif
    }

#endif

#if defined(CFG_MPC5748G) || defined(CFG_MPC5747C) ||defined(CFG_MPC5746C)
    /* Disable watchdog fore Core 0. Watchdog is enabled default after reset.*/
    /*lint -save -e923, -e9048 ARGUMENT_CHECK */
    SWT_0.SR.R = 0xc520;
    SWT_0.SR.R = 0xd928;
    SWT_0.CR.R = 0xFF00010A;

#if defined(USE_WDG)
    SWT_0.TO.R = (uint32)(16000000u*0.5); /* set timeout to 500ms 16MHz IRC clock */
    SWT_0.CR.R = 0xE000011BuL;             /* enable watchdog */
#endif
    /*lint -restore */
#endif
}


#if defined(CFG_MPC5748G) || defined(CFG_MPC5747C) ||defined(CFG_MPC5746C)
static uint32 getPllClock(Mcu_Arc_PeriperalClock_t type) {
    uint32 clock = 0;
    uint32 extal = Mcu_Global.config->McuClockSettingConfig[Mcu_Global.clockSetting].McuClockReferencePointFrequency;

