leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/Mcu_Hw_mpc57xx.c
    switch( type ) {
    case C_PLL_PHI:
        /* Fpll = XOSC * PLL_MFD / ( 2* PLL_RFDPHI ) */
        /*lint -e{923, 931, 9032} HARDWARE_ACCESS */
        clock  = (uint32_t) (extal * PLLDIG.PLLDV.B.MFD / (2u * (1u<<(PLLDIG.PLLDV.B.RFDPHI))));
        break;
    default:
        break;
    }

    return clock;
}
#else
static uint32 getPllClock(Mcu_Arc_PeriperalClock_t type) {
    uint32 clock = 0;
    uint32 extal = Mcu_Global.config->McuClockSettingConfig[Mcu_Global.clockSetting].McuClockReferencePointFrequency;

    switch( type ) {
    case C_PLL1_PHI:
        /* Fpll1 = XOSC * PLL1_MFD / ( 2* PLL1_RFDPHI ) */
        clock  = extal * PLLDIG.PLL1DV.B.MFD / (2 * PLLDIG.PLL1DV.B.RFDPHI);
        break;
    case C_PLL0_PHI:
        /* Fpll0 = XOSC * PLL0_MFD / ( PLL0_PREDIV * PLL0_RFDPHI ) */
        clock = (uint64)extal * PLLDIG.PLL0DV.B.MFD / ( PLLDIG.PLL0DV.B.PREDIV * PLLDIG.PLL0DV.B.RFDPHI);
        break;
    default:
        break;
    }

    return clock;
}
#endif
#if defined(CFG_MPC5744P)
static uint32 getOnChipClock(Mcu_Arc_PeriperalClock_t type) {

    uint32 clock = 0;
    uint32 prescaler = 1;

    switch( type ) {
    case C_SYS_CLK:
        /* Same as "system clock" */
        break;
    case C_PBRIDGE:
        clock = getPllClock(C_PLL1_PHI);
        prescaler = MC_CGM.SC_DC0.B.DIV + 1;
        break;
    default:
        break;
    }

    return clock/prescaler;
}
#endif


/**
 * Get the system clock in Hz. It calculates the clock from the
 * different register settings in HW.
 * @return
 */
uint32 Mcu_Arc_GetSystemClock(void) {

    /* IMPROVEMENT: Check the runmode and then figure out the what PLL
     *              is currently system PLL, we now assume PLL1
     */
#if defined(CFG_MPC5748G) || defined(CFG_MPC5747C) ||defined(CFG_MPC5746C)
	return getPllClock(C_PLL_PHI);
#else
    return getPllClock(C_PLL1_PHI);
#endif
}


#if defined(CFG_MPC5744P)

/***
 * Gets a peripheral clock in Hz.
 * @param type
 * @return
 */
uint32 Mcu_Arc_GetPeripheralClock(Mcu_Arc_PeriperalClock_t type) {
    uint32 sysClock = Mcu_Arc_GetSystemClock();
    vuint32_t prescaler = 1;

    switch (type)
    {
        /* System clocks */
        case C_SYS_CLK:
            break;
        case C_PLL0_PHI:
            /* Non-modulated clock, max 160Mhz */
            break;
        case C_PLL1_PHI:
            /* Modulated clock, max 200Mhz */
            getOnChipClock(C_PLL1_PHI);
            break;
        case PERIPHERAL_CLOCK_PIT_0:
        case PERIPHERAL_CLOCK_PIT_1:
        case PERIPHERAL_CLOCK_PIT_2:
        case PERIPHERAL_CLOCK_PIT_3:
        case PERIPHERAL_CLOCK_DSPI_A:
        case PERIPHERAL_CLOCK_DSPI_B:
        case PERIPHERAL_CLOCK_DSPI_C:
        case PERIPHERAL_CLOCK_DSPI_D:
            // phbridge clock
            prescaler = MC_CGM.SC_DC0.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_FLEXPWM_0:
            // motc clock
            prescaler = MC_CGM.AC0_DC0.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_LIN_A:
        case PERIPHERAL_CLOCK_LIN_B:
            // half sys clock
            prescaler = 2;
            break;
        case PERIPHERAL_CLOCK_FEC_0:
            prescaler = MC_CGM.AC10_DC0.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_STM_0:
            sysClock = getOnChipClock(C_PBRIDGE);
            break;
        default:
            ASSERT(0);
            break;
    }

    return sysClock/(prescaler);

}

#elif defined(CFG_MPC5748G)  || defined(CFG_MPC5747C) ||defined(CFG_MPC5746C)

/***
 * Gets a peripheral clock in Hz.
 * @param type
 * @return
 */
uint32 Mcu_Arc_GetPeripheralClock(Mcu_Arc_PeriperalClock_t type) {
    uint32 sysClock = Mcu_Arc_GetSystemClock();
    vuint32_t prescaler = 1;

    switch (type)
    {
        /* System clocks */
        case C_SYS_CLK:
            break;
        case C_PLL_PHI:
            /* Modulated clock, max 200Mhz */
            //getOnChipClock(C_PLL_PHI);
            break;
        case PERIPHERAL_CLOCK_FLEXCAN_A:
        case PERIPHERAL_CLOCK_FLEXCAN_B:
        case PERIPHERAL_CLOCK_FLEXCAN_C:
        case PERIPHERAL_CLOCK_FLEXCAN_D:
        case PERIPHERAL_CLOCK_FLEXCAN_E:
        case PERIPHERAL_CLOCK_FLEXCAN_F:
        case PERIPHERAL_CLOCK_FLEXCAN_G:
        case PERIPHERAL_CLOCK_FLEXCAN_H:
        case PERIPHERAL_CLOCK_LIN_B:
        case PERIPHERAL_CLOCK_LIN_C:
        case PERIPHERAL_CLOCK_LIN_D:
        case PERIPHERAL_CLOCK_LIN_4:
        case PERIPHERAL_CLOCK_LIN_5:
        case PERIPHERAL_CLOCK_LIN_6:
        case PERIPHERAL_CLOCK_LIN_7:
        case PERIPHERAL_CLOCK_LIN_8:
        case PERIPHERAL_CLOCK_LIN_9:
        case PERIPHERAL_CLOCK_LIN_10:
        case PERIPHERAL_CLOCK_LIN_11:
        case PERIPHERAL_CLOCK_LIN_12:
        case PERIPHERAL_CLOCK_LIN_13:
        case PERIPHERAL_CLOCK_LIN_14:
        case PERIPHERAL_CLOCK_LIN_15:
        case PERIPHERAL_CLOCK_LIN_16:
        case PERIPHERAL_CLOCK_LIN_17:
        	/* FS80 - max 80 MHz */
            /*lint -e{923} HARDWARE_ACCESS */
        	prescaler = MC_CGM.SC_DC5.B.DIV + 1;
        	break;
#if defined(CFG_MPC5746C) || defined(CFG_MPC5747C) || defined(CFG_MPC5748G)
        /* SC_DC0 - S160
         * SC_DC1 - S80
         * SC_DC2 - S40
         * SC_DC3 - F40
         * SC_DC4 - S160
         * SC_DC5 - FS80
         * SC_DC6 - F20
         *
         * We want the baudrate clock for SPI, NOT peripheral clock
         * */
        case PERIPHERAL_CLOCK_SPI_0:	/* SPI_0 */
            /* Baud Clock = FXOSC or F40. Per Clock = S40  */
            /*lint -e{923} HARDWARE_ACCESS */
            prescaler = MC_CGM.SC_DC3.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_SPI_1:	/* SPI_1 */
        case PERIPHERAL_CLOCK_SPI_2:	/* SPI_2 */
            /* Baud Clock = F80. Per Clock = S40  */
            /*lint -e{923} HARDWARE_ACCESS */
            prescaler = MC_CGM.SC_DC4.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_SPI_3:	/* SPI_3 */
#if defined(CFG_MPC5747C) || defined(CFG_MPC5748G)
        case PERIPHERAL_CLOCK_SPI_4:	/* SPI_4 */
        case PERIPHERAL_CLOCK_SPI_5:	/* SPI_5 */
            /* Baud Clock = F40. Per Clock = S40  */
            /*lint -e{923} HARDWARE_ACCESS */
            prescaler = MC_CGM.SC_DC3.B.DIV + 1;
            break;
#endif
#endif

        case PERIPHERAL_CLOCK_DSPI_A:
        case PERIPHERAL_CLOCK_DSPI_B:
        case PERIPHERAL_CLOCK_PIT_0:
        case PERIPHERAL_CLOCK_PIT_1:
        case PERIPHERAL_CLOCK_PIT_2:
        case PERIPHERAL_CLOCK_PIT_3:
        case PERIPHERAL_CLOCK_LIN_A:
        	/* F40 - max 40 MHz (for PIT, etc.) */
            /*lint -e{923} HARDWARE_ACCESS */
        	prescaler = MC_CGM.SC_DC3.B.DIV + 1;
        	break;
        case PERIPHERAL_CLOCK_DSPI_C:
        case PERIPHERAL_CLOCK_DSPI_D:
        	/* F80 - max 80 MHz */
            /*lint -e{923} HARDWARE_ACCESS */
            prescaler = MC_CGM.SC_DC4.B.DIV + 1;
            break;

        case PERIPHERAL_CLOCK_ENET:
        	 // sys clock / 2
            /* F80 - max 80 MHz */
            /*lint -e{923} HARDWARE_ACCESS */
            prescaler = MC_CGM.SC_DC4.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_STM_0:
            /*lint -e{923} HARDWARE_ACCESS */
            prescaler = MC_CGM.SC_DC5.B.DIV + 1; /*FS80 clock*/
            break;
        case PERIPHERAL_CLOCK_EMIOS_0:
        case PERIPHERAL_CLOCK_EMIOS_1:
#if defined(CFG_MPC5748G)  || defined(CFG_MPC5747C)
        case PERIPHERAL_CLOCK_EMIOS_2:
#endif
            /*lint -e{923} HARDWARE_ACCESS */
            prescaler = MC_CGM.SC_DC5.B.DIV + 1; /*FS80 clock*/
            break;

        default:
            ASSERT(0);
            break;
    }

