leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/Mcu_Hw_mpc57xx.c
    return sysClock/(prescaler);

}

#elif defined(CFG_MPC5777M)


/**
 * Gets AuxClock0
 * @return
 */
static uint32 GetAuxClock0(void) {
    uint32 clock = 0;
    if(MC_CGM.AC0_SC.B.SELCTL == 2) {
        // sys clock is driven by pll0
        clock = getPllClock(C_PLL0_PHI);
    }
    return clock;
}


/***
 * Gets a peripheral clock in Hz.
 * @param type
 * @return
 */
uint32_t Mcu_Arc_GetPeripheralClock(Mcu_Arc_PeriperalClock_t type) {
    uint32_t clock = 0;
    vuint32_t prescaler = 1;

    switch (type)
    {
        case PERIPHERAL_CLOCK_M_CAN_1:
        case PERIPHERAL_CLOCK_M_CAN_2:
        case PERIPHERAL_CLOCK_M_CAN_3:
        case PERIPHERAL_CLOCK_M_CAN_4:
            // ppbridge clock
            if (MC_CGM.AC8_SC.B.SELCTL == 0x1) {
                //external clock source
                clock = Mcu_Arc_GetClockReferencePointFrequency();
                MC_CGM.AC8_DC0.R = 0x80000000uL;
                //Div = 0 + 1
                // 40 MHz / 1 = 40 MHz

            } else if (MC_CGM.AC8_SC.B.SELCTL == 0x2) {
                //PLL
                clock = getPllClock(C_PLL0_PHI);
                MC_CGM.AC8_DC0.R = 0x800E0000uL;
                //Div = 14 + 1
                // 600 MHz / 15 = 40 MHz
            }
            prescaler = MC_CGM.AC8_DC0.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_PIT_0:
        case PERIPHERAL_CLOCK_PIT_1:
        case PERIPHERAL_CLOCK_PIT_2:
        case PERIPHERAL_CLOCK_PIT_3:
            clock = GetAuxClock0();
            prescaler = MC_CGM.AC0_DC0.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_STM_0:
            // ppbridge clock
            clock = Mcu_Arc_GetSystemClock();
            prescaler = MC_CGM.SC_DC2.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_DSPI_A:
        case PERIPHERAL_CLOCK_DSPI_B:
        case PERIPHERAL_CLOCK_DSPI_C:
        case PERIPHERAL_CLOCK_DSPI_D:
        case PERIPHERAL_CLOCK_DSPI_12:
        case PERIPHERAL_CLOCK_LIN_A:
        case PERIPHERAL_CLOCK_LIN_B:
        case PERIPHERAL_CLOCK_LIN_14:
        case PERIPHERAL_CLOCK_LIN_15:
        case PERIPHERAL_CLOCK_LIN_16:
            clock = GetAuxClock0();
            prescaler = MC_CGM.AC0_DC4.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_DSPI_E:
        case PERIPHERAL_CLOCK_DSPI_F:
        case PERIPHERAL_CLOCK_DSPI_6:
            clock = GetAuxClock0();
            switch(MC_CGM.AC0_DC3.B.DIV_FMT) {
            case 0:
                // no fraction
                break;
            case 1:
                clock = clock * 10;
                break;
            case 2:
                clock = clock * 100;
                break;
            case 3:
                clock = clock * 1000;
                break;
            }
            prescaler = MC_CGM.AC0_DC3.B.DIV + 1;
            break;
        case PERIPHERAL_CLOCK_FEC_0:
            if ( MC_CGM.AC10_SC.B.SELCTL == 2u)
            {
                clock = getPllClock(C_PLL0_PHI);
            }else{
                clock = Mcu_Arc_GetClockReferencePointFrequency();
            }
            prescaler = MC_CGM.AC10_DC0.B.DIV + 1u;
            break;
        default:
            ASSERT(0);
            break;
    }

    return clock/(prescaler);

}

#else
#error NO CPU defined
#endif

